In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()

In [2]:
sql = '''
SELECT * FROM sells LIMIT 1'''
sells = pd.read_sql(sql, conpf)
sells.dtypes

id               int64
buy_id           int64
date            object
price          float64
fee            float64
vat            float64
net            float64
days             int64
profit         float64
percent        float64
yearly         float64
sequence         int64
chart           object
dividend_id      int64
dtype: object

In [3]:
sql = '''
SELECT * FROM sells ORDER BY id DESC'''
sells = pd.read_sql(sql, conpf)
sells.shape

(699, 14)

In [5]:
sells.query('id == 1034')

,id,buy_id,date,price,fee,vat,net,days,profit,percent,yearly,sequence,chart,dividend_id
0,1034,1266,2023-06-23,10.7,66.45,4.65,32028.9,3,1361.13,4.43831,539.99438,-34,None,0

In [6]:
file_name = 'sells.csv'
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"
osd_file = osd_path + file_name
sells.to_csv(osd_file, header=True, index=False)

In [7]:
sql = '''
SELECT * FROM buys LIMIT 1'''
buys = pd.read_sql(sql, conpf)
buys.dtypes

id            int64
stock_id      int64
date         object
qty           int64
price       float64
fee         float64
vat         float64
status       object
net         float64
kind         object
chart        object
dtype: object

In [8]:
sql = '''
SELECT * FROM buys ORDER BY id DESC'''
buys = pd.read_sql(sql, conpf)
buys.shape

(809, 11)

In [9]:
file_name = 'buys.csv'
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"
osd_file = osd_path + file_name
buys.to_csv(osd_file, header=True, index=False)

In [10]:
sql = '''
SELECT * FROM stocks LIMIT 1'''
stocks = pd.read_sql(sql, conpf)
stocks.dtypes

id              int64
name           object
category_id     int64
website        object
dtype: object

In [11]:
sql = '''
SELECT * FROM stocks ORDER BY name'''
stocks = pd.read_sql(sql, conpf)
stocks.shape

(168, 4)

In [12]:
file_name = 'stocks.csv'
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"
osd_file = osd_path + file_name
stocks.to_csv(osd_file, header=True, index=False)

In [13]:
sql = '''
SELECT * FROM dividends LIMIT 1'''
dividends = pd.read_sql(sql, conpf)
dividends.dtypes

id            int64
stock_id      int64
name         object
year          int64
quarter       int64
number        int64
ppu         float64
amt         float64
net         float64
x_date       object
p_date       object
dtype: object

In [2]:
sql = '''
SELECT * FROM dividends ORDER BY id DESC'''
dividends = pd.read_sql(sql, conpf)
dividends.shape

(394, 11)

In [3]:
file_name = 'dividends.csv'
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"
osd_file = osd_path + file_name
dividends.to_csv(osd_file, header=True, index=False)

### Delete from buys table en mass by stock name

In [20]:
sql = '''
SELECT * FROM buys LIMIT 1'''
buys = pd.read_sql(sql, conpf)
buys.columns

Index(['id', 'stock_id', 'date', 'qty', 'price', 'fee', 'vat', 'status', 'net',
       'kind', 'chart'],
      dtype='object')

In [3]:
sql = '''
SELECT * FROM sells LIMIT 1'''
sells = pd.read_sql(sql, conpf)
sells.columns

Index(['id', 'buy_id', 'date', 'price', 'fee', 'vat', 'net', 'days', 'profit',
       'percent', 'yearly', 'sequence', 'chart', 'dividend_id'],
      dtype='object')

In [2]:
sql = '''
SELECT * FROM stocks LIMIT 1'''
stocks = pd.read_sql(sql, conpf)
stocks.columns

Index(['id', 'name', 'category_id', 'website'], dtype='object')

In [23]:
sql = '''
SELECT * FROM stocks WHERE name = "NOBLE"'''
stocks = pd.read_sql(sql, conpf)
stocks

    id   name  category_id website
0  145  NOBLE            3

In [32]:
id = 145
sql = '''
SELECT * 
FROM buys
WHERE stock_id = %s
AND status = "Active"
AND qty < 63000
'''
sql = sql % id
df = pd.read_sql(sql, conpf)
df

,id,stock_id,date,qty,price,fee,vat,status,net,kind,chart
0,895,145,2021-05-13,6000,7.20,89.42,6.26,Active,43295.68,HD,None
1,889,145,2021-05-11,6000,8.00,99.36,6.96,Active,48106.32,HD,None
2,987,145,2021-08-13,6000,6.50,80.73,5.65,Active,39086.38,HD,None
3,1082,145,2021-12-20,21000,6.10,265.17,18.56,Active,128383.73,HD,None
4,1039,145,2021-11-03,6000,6.40,79.49,5.56,Active,38485.05,HD,None
5,1058,145,2021-11-29,6000,6.25,77.63,5.43,Active,37583.06,HD,None

In [33]:
df.qty.sum()

51000

In [34]:
sqlDel = '''
DELETE 
FROM buys
WHERE stock_id = 145
AND status = "Active"
AND qty < 63000
'''
print(sqlDel)

DELETE
FROM buys
WHERE stock_id = 145
AND status = "Active"
AND qty < 63000

In [35]:
rp = conpf.execute(sqlDel)
rp.rowcount

6